#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр АктуальнаяШкалаБонуснойПрограмы
	Движения.АктуальнаяШкалаБонуснойПрограмы.Записывать = Истина;
	Движение = Движения.АктуальнаяШкалаБонуснойПрограмы.Добавить();
	Движение.Период = Дата;
	Движение.Шкала = Ссылка;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// 1. Нижная граница первого диапозона должна быть равна 0
	// 2. Верхная граница каждого диапозона, кроме последнего, должна быть равно нижней следующего
	// 3. Верхная граница последнего диапозона должна быть равна 0
	// 4. Верхная граница всегда больше нижней границы (кроме последного диапозона)

	Если Диапозоны.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	Если Диапозоны[0].НижнаяГраница <> 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Нижная граница первого диапозона должна быть равна 0");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Диапозоны[0].НижнаяГраница";
		Сообщение.Сообщить();
	КонецЕсли;

	ВерхнаяГраницаПредыдущегоДиапозона = 0;

	Для Сч = 0 По Диапозоны.Количество() - 1 Цикл
		Диапозон = Диапозоны[Сч];

		Если Сч > 0 Тогда
			Если Диапозон.НижнаяГраница <> ВерхнаяГраницаПредыдущегоДиапозона Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Верхная граница диапозона должна быть равна нижней границе следующего");
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = СтрШаблон("Диапозоны[%1].НижнаяГраница", XMLСтрока(Сч));
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;

		Если Диапозон.НижнаяГраница >= Диапозон.ВерхнаяГраница И Сч <> Диапозоны.Количество() - 1 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Верхная граница должна быть всегда больше нижней границы");
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Поле = СтрШаблон("Диапозоны[%1].ВерхнаяГраница", XMLСтрока(Сч));
			Сообщение.Сообщить();
		КонецЕсли;

		ВерхнаяГраницаПредыдущегоДиапозона = Диапозон.ВерхнаяГраница;

	КонецЦикла;

	ПоследнийДиапозон = Диапозоны[Диапозоны.Количество() - 1];

	Если ПоследнийДиапозон.ВерхнаяГраница <> 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Верхная граница последнего диапозона должна быть равна 0");
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = СтрШаблон("Диапозоны[%1].ВерхнаяГраница", XMLСтрока(Диапозоны.Количество()));
		Сообщение.Сообщить();
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли