#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выгрузить(Команда)
	
	// 1. Запускаем длительную операцию
	// 2. Открываем форму ожидания
	// 3. По завершению длительной операции - ывполняем необходимые действия

	ДлительнаяОперация = НачатьВыгрузкуНаСервере(УникальныйИдентификатор);

	Оповещение = Новый ОписаниеОповещения("ВыгрузкаЗавершение", ЭтотОбъект);
	
	ОповещениеОПрогрессе = Новый ОписаниеОповещения("ВыгрузкаОповещениеОПрогрессе", ЭтотОбъект);

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессе;

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);

	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОжиданиеВыгрузки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыгрузкаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Результат.Статус = "Ошибка" Тогда
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаНачалоВыгрузки;
		Возврат;
	КонецЕсли;

	ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
	ПолучитьФайлССервераАсинх(Результат.АдресРезультата, "export.zip", ПараметрыДиалога);
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаЗавершениеВыгрузки;

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузкаОповещениеОПрогрессе(Результат, ДополнительныеПараметры) Экспорт
	ПрогрессДлитеьнойОперации = Строка(Результат.Прогресс.Процент) + "% " + Результат.Прогресс.Текст;
	ПроцентВыполненияДлительнойОперации = Результат.Прогресс.Процент;
КонецПроцедуры

&НаСервереБезКонтекста
Функция НачатьВыгрузкуНаСервере(УникальныйИдентификатор)

	ИмяМетода = "Обработки.ВыгрузкаНаСайт.ПодготовитьАрхив";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);

	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ИмяМетода);

КонецФункции

#КонецОбласти