#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Печать(Команда)

	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Билет");
	ВыполнитьПечать(КоллекцияПечатныхФорм);
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьПечать(КоллекцияПечатныхФорм)

	КоллекцияПечатныхФормТаблица = Новый ТаблицаЗначений;
	Для Каждого ИмяКолонки Из УправлениеПечатьюКлиентСервер.ИменаПолейКоллекцииПечатныхФорм() Цикл
		КоллекцияПечатныхФормТаблица.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;

	Для Каждого ПечатнаяФарма Из КоллекцияПечатныхФорм Цикл
		ЗаполнитьЗначенияСвойств(КоллекцияПечатныхФормТаблица.Добавить(), ПечатнаяФарма);
	КонецЦикла;

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Печать(ДокументНаПечать, КоллекцияПечатныхФормТаблица, Новый СписокЗначений, Новый Структура);

	КоллекцияПечатныхФорм = ОбщегоНазначения.ТаблицаЗначенийВМассив(КоллекцияПечатныхФормТаблица);

КонецПроцедуры

#КонецОбласти